n = int(input('Введите число на камне: '))
list_ = set()
for i in range(1, min(n, 21)):
    j = n - i
    if j >= 1 and j <= 20 and i != j:
        list_.add((min(i, j), max(i, j)))
password = ' '.join([f'{list1[0]} {list1[1]}' for list1 in sorted(list_, reverse=False)])
print(f'Нужный пароль для выхода: {password}')
# Хоть убейте, я не понмаю откуда эти числа в скобках данные в примере
# с одной стороны часть комбинаций правильная, а с другой нет
# и я не могу понять почему,
# поскольку числа в скобках не являются кратной суммой значений этих чисел.
#3 - 12
#4 - 13
#5 - 1423
#6 - (12) 15 24
#7 - 16 25 34
#8 - (13) 17 26 35
#9 - (12) 18 27 36 45
#10 - (14) 19 (23) 28 37 46
#11 - 110 29 38 47 56
#12 - (121315) 111 24 210 39 48 57
#13 - 112 211 310 49 58 67
#14 - (16) 113 (25) 212 (34) 311 410 59 68
#15 - (1214) 114 (23) 213 312 411 510 69 78
#16 - (1317) 115 (26) 214 (35) 313 412 511 610 79
#17 - 116 215 314 413 512 611 710 89
#18 - (121518) 117 (2427) 216 (36) 315 (45) 414 513 612 711 810
#19 - 118 217 316 415 514 613 712 811 910
#20 - (131419) 119 (2328) 218 (37) 317 46 416 515 614 713 812 911
